const messages = {
	start_step: {
		message: `Привет, я бот-опросник🤖

Проходя этот тест вместе - я помогу тебе определить, сможешь ли ты начать зарабатывать вместе с нами и попробовать себя в модельной сфере! 💃

Наше агентство помогает молодым и красивым девушкам зарабатывать удаленно и получать доход в самой стабильной валюте в мире $ 🤑

Здесь будет всего несколько вопросов, поэтому если готова, то пиши мне “ + “ и мы начнем! 📈`,
		photo: './images/1.png'
	},
	age: {
		message: `Сколько тебе полных лет?`,
		photo: './images/2.png'
	},
	dreamCountry: {
		message: `Какую страну ты бы мечтала посетить больше всего? 🤑✈️`,
		photo: './images/3.png'
	},
	country: {
		message: `В какой стране ты проживаешь?`,
	},
	dreamMoney: {
		message: `Сколько ты бы хотела зарабатывать в месяц? Просто пофантазируй, представь, что все возможно...`,
		buttons: ['1️⃣ 1000-1500$', '2️⃣ 2000-2500$', '️3️⃣ 3000-5000$', '4️⃣ 5000-10000$'],
		photo: './images/4.png'
	},
	content: {
		message: `Какой контент ты готова снимать?`,
		buttons: [
			'1️⃣ Уровня Инстаграм / Тик-ток / Соц.сети 📷',
			'2️⃣ Фото как в Реддит (включая ню-формат, легкую эротику) ❤️',
			'3️⃣ Более откровенную эротику 😈',
			'4️⃣ Готова снимать взрослый контент, 18+ 🔥'
		]
	},
	about: {
		message: `Теперь немного о нас, мы профессиональное модельное агентство и помогаем сотням девушек со всего мира зарабатывать деньги на своих социальных сетях. 💰

Тебе было бы интересно узнать детали, как красивые девушки могут зарабатывать удаленно и при этом уделяя работе всего несколько дней в неделю? 📊`,
		buttons: [
			'✅ Да, мне было бы интересно узнать и попробовать себя',
			'❌ Нет, это мне неинтересно, я не готова к изменениям'
		],
		photo: './images/5.png'
	},
	// if sixth step no
	future: {
		message: `Хорошо, возможно, в дальнейшем у тебя появится интерес, тогда ты сможешь пройти заново бот и узнать детали. Чтобы вернуться в конец нажми ➡️ /start ⬅️`
	},
	// if sixth step yes
	contact_on_telegram: {
		message: `Отлично! Мы на финишной прямой, тебе удобно, чтобы наш менеджер связался с тобой в телеграм? 📩`,
		buttons: [
			'✅ Да, отлично',
			'❌ Выберу другой способ'
		]
	},
	// if sixth_step_yes === yes or after seventh_step
	final: {
		message: `Отлично! Наш менеджер свяжется с тобой в самый короткий срок! Прекрасного настроения 🔥🚀`,
		photo: './images/6.png'
	},
	other_contact: {
		message: `Хорошо, введи удобный для себя способ связи`
	}
}

module.exports.messages = messages;
